nxp-mcuxpresso/mcux-soc-svd/MCXA456/MCXA456.xml
        <register>
          <name>LPM_CSR1</name>
          <description>USB LPM Control and Status 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_DEV_BESLTHRES</name>
              <description>Device Required Host Initiated Resume Duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES0</name>
                  <description>75 us, if LPM_ERRATA_EN = 1; 50 us, if LPM_ERRATA_EN = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES1</name>
                  <description>100 us, if LPM_ERRATA_EN = 1; 125 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES2</name>
                  <description>150 us, if LPM_ERRATA_EN = 1; 200 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES3</name>
                  <description>250 us, if LPM_ERRATA_EN = 1; 275 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES4</name>
                  <description>350 us, if LPM_ERRATA_EN = 1; 350 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES5</name>
                  <description>450 us, if LPM_ERRATA_EN = 1; 425 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES6</name>
                  <description>950 us, if LPM_ERRATA_EN = 1; 500 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES7</name>
                  <description>1950 us, if LPM_ERRATA_EN = 1; 575 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES8</name>
                  <description>2950 us, if LPM_ERRATA_EN = 1; 650 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRES9</name>
                  <description>3950 us, if LPM_ERRATA_EN = 1; 725 us, if LPM_ERRATA_EN = 0</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESA</name>
                  <description>4950 us, if LPM_ERRATA_EN = 1; 800 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESB</name>
                  <description>5950 us, if LPM_ERRATA_EN = 1; 875 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESC</name>
                  <description>6950 us, if LPM_ERRATA_EN = 1; 950 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESD</name>
                  <description>7950 us, if LPM_ERRATA_EN = 1; 1025 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESE</name>
                  <description>8950 us, if LPM_ERRATA_EN = 1; 1100 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_BESLTHRESF</name>
                  <description>9950 us, if LPM_ERRATA_EN = 1; 1175 us, if LPM_ERRATA_EN = 0</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_RES</name>
              <description>LPM Device Response</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_RES0</name>
                  <description>Fourth condition not needed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RES1</name>
                  <description>Fourth condition needed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_DP</name>
              <description>LPM Device Data Pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_DP0</name>
                  <description>Not pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_DP1</name>
                  <description>Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_RSPSTS</name>
              <description>LPM Device Response Status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS0</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS1</name>
                  <description>ACK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS2</name>
                  <description>NYET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RSPSTS3</name>
                  <description>STALL</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_RWKENRCVD</name>
              <description>LPM Device Received bRemoteWake</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_RWKENRCVD0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DEV_RWKENRCVD1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_LNKSTRCVD</name>
              <description>LPM Device Received bLinkState</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_DEV_LNKSTRCVD1</name>
                  <description>L1 (Sleep mode)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_DEV_BESLRCVD</name>
              <description>LPM Device Received BESL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPM_CSR2</name>
          <description>USB LPM Control and Status 2</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPM_HST_SEND</name>
              <description>LPM Host Send Extension Token</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_HST_SEND0</name>
                  <description>LPM transaction did not happen or is complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_SEND1</name>
                  <description>LPM transaction is ongoing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_HST_DEVADD</name>
              <description>LPM Host Extension Token's Device Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_HST_BESL</name>
              <description>LPM Host Extension Token's BESL or HIRD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_HST_RWKEN</name>
              <description>LPM Host Extension Token's bRemoteWake</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_HST_RWKEN0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_RWKEN1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPM_HST_STSRCVD</name>
              <description>LPM Host Response Status from the Device</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD0</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD1</name>
                  <description>ACK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD2</name>
                  <description>NYET</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD3</name>
                  <description>STALL</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD4</name>
                  <description>Timeout</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_HST_STSRCVD5</name>
                  <description>ERR</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_RECOVER_CTRL</name>
          <description>USB Clock Recovery Control</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TRIM_INIT_VAL_SEL</name>
              <description>Selects the source for the initial FIRC192M trim fine value used after a reset.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INIT_TRIM_FINE_MID</name>
                  <description>Mid-scale</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT_TRIM_FINE_IFR</name>
                  <description>IFR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART_IFRTRIM_EN</name>
              <description>Restart from IFR Trim Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOAD_TRIM_FINE_MID</name>
                  <description>Trim fine adjustment always works based on the previous updated trim fine value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_TRIM_FINE_IFR</name>
                  <description>Trim fine restarts from the IFR trim value whenever you detect bus_reset or bus_resume or deassert module enable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET_RESUME_ROUGH_EN</name>
              <description>Reset or Resume to Rough Phase Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEEP_TRIM_FINE_ON_RESET</name>
                  <description>Always works in tracking phase after the first time rough phase, to track transition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_IFR_TRIM_FINE_ON_RESET</name>
                  <description>Go back to rough stage whenever a bus reset or bus resume occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLOCK_RECOVER_EN</name>
              <description>Crystal-Less USB Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_CLK_RECOVER</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_CLK_RECOVER</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_RECOVER_IRC_EN</name>
          <description>FIRC Oscillator Enable</description>
          <addressOffset>0x204</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IRC_EN</name>
              <description>Fast IRC enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_IRC</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_IRC</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_RECOVER_INT_EN</name>
          <description>Clock Recovery Combined Interrupt Enable</description>
          <addressOffset>0x214</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>OVF_ERROR_EN</name>
              <description>Overflow error interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_OVF_ERR_INT</name>
                  <description>The interrupt is masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_OVF_ERR_INT</name>
                  <description>The interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_RECOVER_INT_STATUS</name>
          <description>Clock Recovery Separated Interrupt Status</description>
          <addressOffset>0x21C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>OVF_ERROR</name>
              <description>Overflow Error Interrupt Status Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>INT_NO</name>
                  <description>Interrupt did not occur</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_YES</name>
                  <description>Unmasked interrupt occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
