nxp-mcuxpresso/mcux-soc-svd/MCXA456/MCXA456.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>TSI0</name>
      <description>TSI</description>
      <groupName>TSI</groupName>
      <baseAddress>0x400C3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x114</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TSI_END_OF_SCAN</name>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>TSI_OUT_OF_SCAN</name>
        <value>125</value>
      </interrupt>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>TSI CONFIG Register (TSI_CONFIG) for self-capacitor</description>
          <alternateGroup>SELF</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>Self-cap mode, this address is TSI_SEL_CONFIG</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>Mutual-cap mode, this address is TSI_MUL_CONFIG</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTER_TRIM</name>
              <description>FILTER_TRIM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER_TRIM_0</name>
                  <description>filter bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_TRIM_1</name>
                  <description>5.3ns</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_TRIM_2</name>
                  <description>21.1ns</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_TRIM_3</name>
                  <description>25ns</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELF_BYPASS_FLT</name>
              <description>self_bypass_flt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELF_BYPASS_FLT_0</name>
                  <description>LPF is not bypassed (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BYPASS_FLT_1</name>
                  <description>LPF is bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIN_SCALE_DOWN_TRIM</name>
              <description>xin_scale_down_trim</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_0</name>
                  <description>1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_1</name>
                  <description>1/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_2</name>
                  <description>1/3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_3</name>
                  <description>1/4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_4</name>
                  <description>1/5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_5</name>
                  <description>1/6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_6</name>
                  <description>1/7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_TRIM_7</name>
                  <description>1/8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIN_SCALE_DOWN</name>
              <description>xin_scale_down</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_0</name>
                  <description>1 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_1</name>
                  <description>1/2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_2</name>
                  <description>1/3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_3</name>
                  <description>1/4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_4</name>
                  <description>1/5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_5</name>
                  <description>1/6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_6</name>
                  <description>1/7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XIN_SCALE_DOWN_7</name>
                  <description>1/8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELF_BOOST_SCALE</name>
              <description>self_boost_scale</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_0</name>
                  <description>500 nA (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_1</name>
                  <description>1 uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_2</name>
                  <description>1.5 uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_3</name>
                  <description>2 uA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_4</name>
                  <description>2.5 uA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_5</name>
                  <description>3 uA</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_6</name>
                  <description>3.5 uA</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_SCALE_7</name>
                  <description>4 uA</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_NOISE</name>
              <description>S_NOISE</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_NOISE_0</name>
                  <description>Noise cancellation off (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_NOISE_1</name>
                  <description>Noise cancellation on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XCH</name>
              <description>S_XCH</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_XCH_0</name>
                  <description>1/16 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_1</name>
                  <description>1/8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_2</name>
                  <description>1/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_3</name>
                  <description>1/2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_4</name>
                  <description>1/1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_5</name>
                  <description>2/1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_6</name>
                  <description>4/1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_7</name>
                  <description>8/1</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XIN</name>
              <description>S_XIN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_XIN_0</name>
                  <description>1/8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XIN_1</name>
                  <description>1/4 (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_SEN</name>
              <description>S_SEN</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_SEN_0</name>
                  <description>Sensitivity boost off (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_SEN_1</name>
                  <description>Sensitivity boost on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XDN</name>
              <description>S_XDN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_XDN_0</name>
                  <description>1/16 (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_1</name>
                  <description>1/8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_2</name>
                  <description>1/4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_3</name>
                  <description>1/2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_4</name>
                  <description>NA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_5</name>
                  <description>NA</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_6</name>
                  <description>NA</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_7</name>
                  <description>NA</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELF_BOOST_MODE</name>
              <description>self_boost_mode</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELF_BOOST_MODE_0</name>
                  <description>Cap boost mode (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELF_BOOST_MODE_1</name>
                  <description>Current boost mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
