nxp-mcuxpresso/mcux-soc-svd/MCXA456/MCXA456.xml
        <register>
          <name>CONFIG_MUTUAL</name>
          <description>TSI CONFIG register (TSI_CONFIG) for mutual-capacitor (CONFIG_MUTUAL)</description>
          <alternateGroup>CONFIG_MUTUAL</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2802007E</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>Self-cap mode, this address is TSI_CONFIG for self-cap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>Mutual-cap mode, this address is TSI_CONFIG for mutual-cap</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_NMIRROR</name>
              <description>M_NMIRROR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_NMIRROR_0</name>
                  <description>m=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIRROR_1</name>
                  <description>m=2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIRROR_2</name>
                  <description>m=3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_NMIRROR_3</name>
                  <description>m=4 (default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PMIRRORR</name>
              <description>M_PMIRRORR</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PMIRRORR_0</name>
                  <description>m=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORR_1</name>
                  <description>m=2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORR_2</name>
                  <description>m=3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORR_3</name>
                  <description>m=4 (default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PMIRRORL</name>
              <description>M_PMIRRORL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PMIRRORL_0</name>
                  <description>m=4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_1</name>
                  <description>m=8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_2</name>
                  <description>m=12</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_3</name>
                  <description>m=16 (default)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_4</name>
                  <description>m=20</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_5</name>
                  <description>m=24</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_6</name>
                  <description>m=28</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PMIRRORL_7</name>
                  <description>m=32</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_CNT_EN</name>
              <description>M_CNT_EN</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_CNT_EN_0</name>
                  <description>Disable, the counter works in all scan process</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_CNT_EN_1</name>
                  <description>Enable, the counter only works when the capacitor does the integration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_TX_PD_EN</name>
              <description>M_TX_PD_EN</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_TX_PD_EN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_TX_PD_EN_1</name>
                  <description>Enable (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEN_BOOST</name>
              <description>M_SEN_BOOST</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_SEN_BOOST_0</name>
                  <description>0 u</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_1</name>
                  <description>2 u</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_2</name>
                  <description>4 u</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_3</name>
                  <description>6 u</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_4</name>
                  <description>8 u</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_5</name>
                  <description>10 u</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_6</name>
                  <description>12 u</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_7</name>
                  <description>14 u</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_8</name>
                  <description>16 u</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_9</name>
                  <description>18 u</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_10</name>
                  <description>20 u</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_11</name>
                  <description>22 u</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_12</name>
                  <description>24 u</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_13</name>
                  <description>26 u</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_14</name>
                  <description>28 u</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_15</name>
                  <description>30 u</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_16</name>
                  <description>32 u</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_17</name>
                  <description>34 u</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_18</name>
                  <description>36 u</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_19</name>
                  <description>38 u</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_20</name>
                  <description>40 u</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_21</name>
                  <description>42 u</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_22</name>
                  <description>44 u</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_23</name>
                  <description>46 u</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_24</name>
                  <description>48 u</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_25</name>
                  <description>50 u</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_26</name>
                  <description>52 u</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_27</name>
                  <description>54 u</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_28</name>
                  <description>56 u</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_29</name>
                  <description>58 u</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_30</name>
                  <description>60 u</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_BOOST_31</name>
                  <description>62 u</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE_CHRG_MODE</name>
              <description>PRE_CHRG_MODE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRE_CHRG_MODE_0</name>
                  <description>Mode 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRE_CHRG_MODE_1</name>
                  <description>Mode 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PRE_RES</name>
              <description>M_PRE_RES</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PRE_RES_0</name>
                  <description>1 kohm</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_1</name>
                  <description>2 kohm</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_2</name>
                  <description>3 kohm</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_3</name>
                  <description>4 kohm</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_4</name>
                  <description>5 kohm</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_5</name>
                  <description>6 kohm</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_6</name>
                  <description>7 kohm</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_7</name>
                  <description>8 kohm</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PRE_CURRENT</name>
              <description>M_PRE_CURRENT</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_0</name>
                  <description>1 uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_1</name>
                  <description>2 uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_2</name>
                  <description>3 uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_3</name>
                  <description>4 uA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_4</name>
                  <description>5 uA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_5</name>
                  <description>6 uA</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_6</name>
                  <description>7 uA</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_7</name>
                  <description>8 uA</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHD</name>
          <description>TSI Threshold Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THRESL</name>
              <description>TSI Wakeup Channel Low-Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESH</name>
              <description>TSI Wakeup Channel High-threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
