nxp-mcuxpresso/mcux-soc-svd/MCXA456/MCXA456.xml
        <register>
          <name>SSC0</name>
          <description>TSI SSC Register 0</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x60320000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSC_PRESCALE_NUM</name>
              <description>SSC_PRESCALE_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_0</name>
                  <description>div1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_1</name>
                  <description>div2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_3</name>
                  <description>div4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_7</name>
                  <description>div8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_15</name>
                  <description>div16</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_31</name>
                  <description>div32</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_63</name>
                  <description>div64</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_127</name>
                  <description>div128</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_PRESCALE_NUM_255</name>
                  <description>div256</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASE_NOCHARGE_NUM</name>
              <description>BASE_NOCHARGE_NUM</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_0</name>
                  <description>The SSC output bit 1's basic period will be 1 clock cycle of system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_1</name>
                  <description>The SSC output bit 1's basic period will be 2 clock cycles of system clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_2</name>
                  <description>The SSC output bit 1's basic period will be 3 clock cycles of system clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_3</name>
                  <description>The SSC output bit 1's basic period will be 4 clock cycles of system clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_4</name>
                  <description>The SSC output bit 1's basic period will be 5 clock cycles of system clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_5</name>
                  <description>The SSC output bit 1's basic period will be 6 clock cycles of system clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_6</name>
                  <description>The SSC output bit 1's basic period will be 7 clock cycles of system clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_7</name>
                  <description>The SSC output bit 1's basic period will be 8 clock cycles of system clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_8</name>
                  <description>The SSC output bit 1's basic period will be 9 clock cycles of system clock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_9</name>
                  <description>The SSC output bit 1's basic period will be 10 clock cycles of system clock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_10</name>
                  <description>The SSC output bit 1's basic period will be 11 clock cycles of system clock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_11</name>
                  <description>The SSC output bit 1's basic period will be 12 clock cycles of system clock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_12</name>
                  <description>The SSC output bit 1's basic period will be 13 clock cycles of system clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_13</name>
                  <description>The SSC output bit 1's basic period will be 14 clock cycles of system clock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_14</name>
                  <description>The SSC output bit 1's basic period will be 15 clock cycles of system clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_NOCHARGE_NUM_15</name>
                  <description>The SSC output bit 1's basic period will be 16 clock cycles of system clock</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHARGE_NUM</name>
              <description>CHARGE_NUM</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHARGE_NUM_0</name>
                  <description>The SSC output bit 0's period will be 1 clock cycle of system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_1</name>
                  <description>The SSC output bit 0's period will be 2 clock cycles of system clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_2</name>
                  <description>The SSC output bit 0's period will be 3 clock cycles of system clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_3</name>
                  <description>The SSC output bit 0's period will be 4 clock cycles of system clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_4</name>
                  <description>The SSC output bit 0's period will be 5 clock cycles of system clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_5</name>
                  <description>The SSC output bit 0's period will be 6 clock cycles of system clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_6</name>
                  <description>The SSC output bit 0's period will be 7 clock cycles of system clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_7</name>
                  <description>The SSC output bit 0's period will be 8 clock cycles of system clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_8</name>
                  <description>The SSC output bit 0's period will be 9 clock cycles of system clock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_9</name>
                  <description>The SSC output bit 0's period will be 10 clock cycles of system clock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_10</name>
                  <description>The SSC output bit 0's period will be 11 clock cycles of system clock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_11</name>
                  <description>The SSC output bit 0's period will be 12 clock cycles of system clock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_12</name>
                  <description>The SSC output bit 0's period will be 13 clock cycles of system clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_13</name>
                  <description>The SSC output bit 0's period will be 14 clock cycles of system clock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_14</name>
                  <description>The SSC output bit 0's period will be 15 clock cycles of system clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGE_NUM_15</name>
                  <description>The SSC output bit 0's period will be 16 clock cycles of system clock</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSC_CONTROL_REVERSE</name>
              <description>SSC_CONTROL_REVERSE</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSC_CONTROL_REVERSE_0</name>
                  <description>Keep the polarity of the SSC output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_CONTROL_REVERSE_1</name>
                  <description>Reverse the polarity of the SSC output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSC_MODE</name>
              <description>SSC_MODE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSC_MODE_0</name>
                  <description>Using PRBS method generating SSC output bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_MODE_1</name>
                  <description>Using up-down counter generating SSC output bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_MODE_2</name>
                  <description>SSC function is disabled</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSC_MODE_3</name>
                  <description>NC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRBS_OUTSEL</name>
              <description>PRBS_OUTSEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_0</name>
                  <description>NC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_1</name>
                  <description>NC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_2</name>
                  <description>The order of the primitive polynomial is 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_3</name>
                  <description>The order of the primitive polynomial is 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_4</name>
                  <description>The order of the primitive polynomial is 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_5</name>
                  <description>The order of the primitive polynomial is 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_6</name>
                  <description>The order of the primitive polynomial is 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_7</name>
                  <description>The order of the primitive polynomial is 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_8</name>
                  <description>The order of the primitive polynomial is 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_9</name>
                  <description>The order of the primitive polynomial is 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_10</name>
                  <description>The order of the primitive polynomial is 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_11</name>
                  <description>The order of the primitive polynomial is 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_12</name>
                  <description>The order of the primitive polynomial is 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_13</name>
                  <description>The order of the primitive polynomial is 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_14</name>
                  <description>The order of the primitive polynomial is 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRBS_OUTSEL_15</name>
                  <description>The order of the primitive polynomial is 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSC1</name>
          <description>TSI SSC Register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRBS_SEED_LO</name>
              <description>PRBS_SEED_LO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_SEED_HI</name>
              <description>PRBS_SEED_HI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_WEIGHT_LO</name>
              <description>PRBS_WEIGHT_LO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_WEIGHT_HI</name>
              <description>PRBS_WEIGHT_HI</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
