nxp-mcuxpresso/mcux-soc-svd/MCXA456/MCXA456.xml
        <register>
          <name>SSC2</name>
          <description>TSI SSC Register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080101</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOVE_REPEAT_NUM</name>
              <description>MOVE_REPEAT_NUM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_0</name>
                  <description>The up_down counter will be updated for every sample-charge cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_1</name>
                  <description>The up_down counter will be updated for every 2 sample-charge cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_2</name>
                  <description>The up_down counter will be updated for every 3 sample-charge cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_3</name>
                  <description>The up_down counter will be updated for every 4 sample-charge cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_4</name>
                  <description>The up_down counter will be updated for every 5 sample-charge cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_5</name>
                  <description>The up_down counter will be updated for every 6 sample-charge cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_REPEAT_NUM_6</name>
                  <description>The up_down counter will be updated for every 7 sample-charge cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_STEPS_NUM</name>
              <description>MOVE_STEPS_NUM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_0</name>
                  <description>The added value for up-down counter is 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_1</name>
                  <description>The added value for up-down counter is 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_2</name>
                  <description>The added value for up-down counter is 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_3</name>
                  <description>The added value for up-down counter is 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_4</name>
                  <description>The added value for up-down counter is 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_5</name>
                  <description>The added value for up-down counter is 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_6</name>
                  <description>The added value for up-down counter is 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_STEPS_NUM_7</name>
                  <description>The added value for up-down counter is 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MAX</name>
              <description>MOVE_NOCHARGE_MAX</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOVE_NOCHARGE_MIN</name>
              <description>MOVE_NOCHARGE_MIN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_0</name>
                  <description>The SSC output bit 1's min period will be (1 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycle of system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_1</name>
                  <description>The SSC output bit 1's min period will be (2 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_2</name>
                  <description>The SSC output bit 1's min period will be (3 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_3</name>
                  <description>The SSC output bit 1's min period will be (4 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_4</name>
                  <description>The SSC output bit 1's min period will be (5 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_5</name>
                  <description>The SSC output bit 1's min period will be (6 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_6</name>
                  <description>The SSC output bit 1's min period will be (7 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_7</name>
                  <description>The SSC output bit 1's min period will be (8 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_8</name>
                  <description>The SSC output bit 1's min period will be (9 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_9</name>
                  <description>The SSC output bit 1's min period will be (10 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_10</name>
                  <description>The SSC output bit 1's min period will be (11 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_11</name>
                  <description>The SSC output bit 1's min period will be (12 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_12</name>
                  <description>The SSC output bit 1's min period will be (13 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_13</name>
                  <description>The SSC output bit 1's min period will be (14 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_14</name>
                  <description>The SSC output bit 1's min period will be (15 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOVE_NOCHARGE_MIN_15</name>
                  <description>The SSC output bit 1's min period will be (16 + TSI_SSC0[BASE_ NOCHARGE_NUM]) clock cycles of system clock</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASELINE</name>
          <description>TSI Baseline Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSI_BASELINE</name>
              <description>TSI_BASELINE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE_TRACE_DEBOUNCE</name>
              <description>BASE_TRACE_DEBOUNCE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_0</name>
                  <description>The current counter value takes 0 ratio</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_1</name>
                  <description>The current counter value takes 1/16 ratio</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_2</name>
                  <description>The current counter value takes 2/16 ratio</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_3</name>
                  <description>The current counter value takes 3/16 ratio</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_4</name>
                  <description>The current counter value takes 4/16 ratio</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_5</name>
                  <description>The current counter value takes 5/16 ratio</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_6</name>
                  <description>The current counter value take 6/16 ratio</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_7</name>
                  <description>The current counter value takes 7/16 ratio</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_8</name>
                  <description>The current counter value takes 8/16 ratio</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_9</name>
                  <description>The current counter value takes 9/16 ratio</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_10</name>
                  <description>The current counter value takes 10/16 ratio</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_11</name>
                  <description>The current counter value takes 11/16 ratio</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_12</name>
                  <description>The current counter value takes 12/16 ratio</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_13</name>
                  <description>The current counter value takes 13/16 ratio</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_14</name>
                  <description>The current counter value takes 14/16 ratio</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASE_TRACE_DEBOUNCE_15</name>
                  <description>The current counter value takes 15/16 ratio</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASE_TRACE_EN</name>
              <description>BASE_TRACE_EN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THESHOLD_RATIO</name>
              <description>THESHOLD_RATIO</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_0</name>
                  <description>The thresholdh = baseline+counter/2, and thresholdl = baseline-counter/2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_1</name>
                  <description>The thresholdh = baseline+counter/4, and thresholdl = baseline-counter/4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_2</name>
                  <description>The thresholdh = baseline+counter/8, and thresholdl = baseline-counter/8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_3</name>
                  <description>The thresholdh = baseline+counter/16, and thresholdl = baseline-counter/16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_4</name>
                  <description>The thresholdh = baseline+counter/32, and thresholdl = baseline-counter/32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_5</name>
                  <description>The thresholdh = baseline+counter/64, and thresholdl = baseline-counter/64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_6</name>
                  <description>The thresholdh = baseline+counter/128, and thresholdl = baseline-counter/128</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THESHOLD_RATIO_7</name>
                  <description>The thresholdh = baseline+counter/256, and thresholdl = baseline-counter/256</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD_TRACE_EN</name>
              <description>THRESHOLD_TRACE_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRESHOLD_TRACE_EN_0</name>
                  <description>Disable threshold trace function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRESHOLD_TRACE_EN_1</name>
                  <description>Enable threshold trace function</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIELD</name>
          <description>TSI Shield Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_SEN_RES</name>
              <description>M_SEN_RES</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_SEN_RES_0</name>
                  <description>10 k</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_1</name>
                  <description>10 k + (2.5/3) k (just for auto-calibration)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_2</name>
                  <description>12.5 k (default)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_14</name>
                  <description>25 k</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SELF_SEL_31_0</name>
          <description>Self-cap mode channels selection(CH31~CH0)</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_SELF_31_0</name>
              <description>Config TSI channel as self-cap mode among CH31~CH0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SELF_SEL_63_32</name>
          <description>Self-cap mode channels selection(CH63~CH32)</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_SELF_63_32</name>
              <description>Config TSI channel as self-cap mode among CH63~CH32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SELF_SEL_69_64</name>
          <description>Self-cap mode channels selection(CH69~CH64)</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_SELF_69_64</name>
              <description>Config TSI channel as self-cap mode among CH69~CH64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIELD_SEL_31_0</name>
          <description>Shield mode channels selection(CH31~CH0)</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_SHIELD_31_0</name>
              <description>Config TSI channel as shield mode among CH31~CH0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIELD_SEL_63_32</name>
          <description>Shield mode channels selection(CH63~CH32)</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AS_SHIELD_63_32</name>
              <description>Config TSI channel as shield mode among CH63~CH32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
