nxp-mcuxpresso/mcux-soc-svd/MCXA456/MCXA456.xml
        <register>
          <name>TRIG</name>
          <description>TSI AUTO TRIG Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG_PERIOD_COUNTER</name>
              <description>TRIG_PERIOD_COUNTER</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_CLK_DIVIDER</name>
              <description>TRIG_CLK_DIVIDER</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_0</name>
                  <description>No divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_1</name>
                  <description>Divided by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_2</name>
                  <description>Divided by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_3</name>
                  <description>Divided by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_4</name>
                  <description>Divided by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_5</name>
                  <description>Divided by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_6</name>
                  <description>Divided by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_7</name>
                  <description>Divided by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_8</name>
                  <description>Divided by 9</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_9</name>
                  <description>Divided by 10</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_10</name>
                  <description>Divided by 11</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_11</name>
                  <description>Divided by 12</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_12</name>
                  <description>Divided by 13</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_13</name>
                  <description>Divided by 14</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_14</name>
                  <description>Divided by 15</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_15</name>
                  <description>Divided by 16</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_16</name>
                  <description>Divided by 17</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_17</name>
                  <description>Divided by 18</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_18</name>
                  <description>Divided by 19</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_19</name>
                  <description>Divided by 20</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_20</name>
                  <description>Divided by 21</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_21</name>
                  <description>Divided by 22</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_22</name>
                  <description>Divided by 23</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_23</name>
                  <description>Divided by 24</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_24</name>
                  <description>Divided by 25</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_25</name>
                  <description>Divided by 26</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_26</name>
                  <description>Divided by 27</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_27</name>
                  <description>Divided by 28</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_28</name>
                  <description>Divided by 29</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_29</name>
                  <description>Divided by 30</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_30</name>
                  <description>Divided by 31</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_DIVIDER_31</name>
                  <description>Divided by 32</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_EN</name>
              <description>TRIG_EN</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_EN_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_CLK_SEL</name>
              <description>TRIG_CLK_SEL</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_CLK_SEL_0</name>
                  <description>32 KHz clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_CLK_SEL_1</name>
                  <description>clksoc</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>TSI TEST Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSI_TEST_EN</name>
              <description>TSI_TEST_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSI_TEST_EN_0</name>
                  <description>Test mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_TEST_EN_1</name>
                  <description>Test mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD_TEST_EN</name>
              <description>DPD_TEST_EN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPD_TEST_EN_0</name>
                  <description>IP is not entering dpd test mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPD_TEST_EN_1</name>
                  <description>IP is entering dpd test mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPD_TEST_EOSF</name>
              <description>End of Scan Flag in DPD test mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPD_TEST_EOSF_0</name>
                  <description>Scan is not done in DPD test mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPD_TEST_EOSF_1</name>
                  <description>Scan is done in DPD test mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSI_ANA_TEST_SETTING</name>
              <description>TSI_ANA_TEST_SETTING</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_0</name>
                  <description>Normal operation mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_1</name>
                  <description>Test mode 1, Vref test</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_2</name>
                  <description>Test mode 2, Vprechrg voltage test</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_3</name>
                  <description>Test mode 3, Comparator test</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_4</name>
                  <description>Test mode 4, Precharge function test</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_5</name>
                  <description>Test mode 5, 4uA bias test</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_6</name>
                  <description>Test mode 6, 2uA bias test</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSI_ANA_TEST_SETTING_7</name>
                  <description>Test mode 7, Function monitor test</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSOC_SEL</name>
              <description>CLKSOC_SEL</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RUN_CTRL</name>
              <description>RUN_CTRL</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN_CTRL_0</name>
                  <description>Gate analog switch clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTRL_1</name>
                  <description>Not gate analog switch clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
